lib/tasks/my_namespace.rake

  		{name:"OPPO A77", price:"10300", quantity:"25", description:"Handset, Travel Adapter, USB Cable, Ejection Pin", size:"no size", brand_id: 11}]

  		product_data.each do |data|
  			Product.create(data)
---
INSERT INTO "products" ("name", "price", "quantity", "description", "size", "created_at", "updated_at", "brand_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)