app/views/home/index.html.erb

SELECT "products".* FROM "products"
---

      <% Product.all.each do |product| %>

SELECT "products".* FROM "products"
---

      <% Product.all.each do |product| %>