app/controllers/brands_controller.rb

SELECT "brands".* FROM "brands"
---
  def show
    @brand=Brand.all

INSERT INTO "brands" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "samsung"], ["description", "samsung description"], ["created_at", "2019-05-15 12:55:22.094602"], ["updated_at", "2019-05-15 12:55:22.094602"]]
---
  def create
    @brand=Brand.new(brand_params)
    if @brand.save

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @brand=Brand.find(params[:id])

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "brands" SET "name" = ?, "description" = ?, "logo" = ?, "updated_at" = ? WHERE "brands"."id" = ?  [["name", "adidas"], ["description", "shoes"], ["logo", "index..jpeg"], ["updated_at", "2019-05-14 10:41:28.206208"], ["id", 3]]
---
  def update
    @brand = Brand.find(params[:id])

    if @brand.update(brand_params)

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 1]]
---
  def destroy
    @brand = Brand.find(params[:id])
    @brand.destroy

SELECT  "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT ?  [["name", "admin"], ["LIMIT", 1]]
---
    def set_user!
      admin = Role.find_by_name("admin")
      if current_user.present? && current_user.role_id != admin.id