app/controllers/brands_controller.rb

	def create
		@brand=Brand.new(brand_params)
		@brand.save
---
INSERT INTO "brands" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "fdd"], ["description", "dfff"], ["created_at", "2019-05-14 07:21:49.712229"], ["updated_at", "2019-05-14 07:21:49.712229"]]