app/controllers/brands_controller.rb

DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 6]]
---
	def destroy
		@brand = Brand.find(params[:id])
		@brand.destroy