app/controllers/home_controller.rb

SELECT "products".* FROM "products"
SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
  def index
  	@products = Product.all
  	@products = @products.page params[:page]

SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "products"
SELECT "products".* FROM "products" WHERE (lower(name) LIKE 'shirt')
---
  def welcome
  	@products = Product.all
  	@products = @products.page params[:page]

SELECT "products".* FROM "products" WHERE (lower(name) LIKE 'shoes')
SELECT  "products".* FROM "products" WHERE (lower(name) LIKE 'oppomobile') ORDER BY "products"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "brands".* FROM "brands" WHERE (lower(name) LIKE 'mobile')
SELECT "products".* FROM "products" WHERE (lower(name) LIKE NULL)
SELECT  "products".* FROM "products" WHERE "products"."brand_id" = ? LIMIT ?  [["brand_id", 11], ["LIMIT", 11]]
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "brands".* FROM "brands" WHERE (lower(name) LIKE 'oppomobile') ORDER BY "brands"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE (lower(name) LIKE 'shirt')
---
  def search
  	if params[:search].blank?
    	redirect_to(home_welcome_path, alert: "Empty field!") and return
    else
    	@parameter = params[:search].downcase
    	@products = Product.all.where("lower(name) LIKE :search", search: @parameter)
      @brands = Brand.all.where("lower(name) LIKE :search", search: @parameter)
    	redirect_to home_show_search_path(:search => params[:search].downcase)
    end

    if @products.present?
      @proBrand = @products.first.brand
    else
      @brand = @brands.first.products

SELECT "products".* FROM "products" WHERE (lower(name) LIKE 'shirt')
SELECT "brands".* FROM "brands" WHERE (lower(name) LIKE 'oppomobile')
SELECT "products".* FROM "products" WHERE (lower(name) LIKE 'oppomobile')
SELECT  1 AS one FROM "products" LIMIT ?  [["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE (lower(name) LIKE :search) LIMIT ?  [["LIMIT", 11]]
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "brands".* FROM "brands" WHERE (lower(name) LIKE 'oppomobile') ORDER BY "brands"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def show_search
  	@parameter = params["search"]
    @products = Product.all.where("lower(name) LIKE :search", search: @parameter)
    @brands = Brand.all.where("lower(name) LIKE :search", search: @parameter)
   # @prod =Product.find(params[:id])
    if @products.present?
      @proBrand = @products.first.brand
    else
      @brand = @brands.first.products