app/controllers/products_controller.rb

  def show
    @products = Product.all
    @products = @products.page params[:page]
---
SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "products"

  def create

    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "price", "quantity", "description", "size", "created_at", "updated_at", "brand_id", "images") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "images" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["images", "[\"mobile1.jpeg\"]"], ["updated_at", "2019-05-17 09:11:05.990563"], ["id", 6]]

    def set_user!
        admin = Role.find_by_name("admin")
        if current_user.present? && current_user.role_id != admin.id
---
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT ?  [["name", "admin"], ["LIMIT", 1]]