app/models/user.rb

SELECT  "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT ?  [["name", "customer"], ["LIMIT", 1]]
---
  def set_default_role
    binding.pry
  	role=Role.find_by_name("customer")